// P32.空间换时间
// 给出n个字母（小写字母从a到z），找出次数最多的字母并输出该字母
#include <iostream>
#include <chrono>
#include <thread>
#include <vector>
using namespace std;
using namespace chrono;

void solution_1(const vector<char>& a) {
    char result; // 表示出现次数最多的字母
    int max_count = 0; // 记录result出现的最多次数
    for(int i = 0; i < a.size(); i++) {
        int num = 0; // 记录a[i]出现的次数
        for(int j = 0; j < a.size(); j++) {
            if (a[i] == a[j]) {
                num ++;
            }
        }
        if (num > max_count) {//如果a[i]出现的次数大于max_count,就把a[i]及其出现的次数都记录下来
            result = a[i];
            max_count = num;
        }
    }
    cout << "出现最多的字母是：" << result << "，出现的次数：" << max_count <<endl;
}

// 时间复杂度：O(n^2)
// 空间复杂度：O(1)
// 出现最多的字母是：b，出现的次数：225
// 耗时：18 ms

void solution_2(const vector<char>& a) {
    int record[26] = {0}; // 存放26个字母出现的次数，初始化为0
    for(int i = 0; i < a.size(); i++) {
        record[a[i] - 'a'] ++; // 用字符的ASCII码来做运算，生成对应的数组下标，数组下标对应的数据就是该字符出现的次数
    }
    char result; // 表示出现次数最多的字母
    int max_count = 0; // 记录result出现的最多次数

    for(int i = 0; i < 26; i++){
        if(record[i] > max_count) {
            max_count = record[i];
            result = i +'a'; // 使用ASCII码来做运算
        }
    }

    cout << "出现最多的字母是：" << result << "，出现的次数：" << max_count <<endl;
}

// 时间复杂度：O(n)
// 空间复杂度：O(1)
// 出现最多的字母是：b，出现的次数：225
// 耗时：2 ms

int main()
{

    milliseconds start_time = duration_cast<milliseconds>(
        system_clock::now().time_since_epoch());

    int arr[] = {1,2,3,4,5};
    const vector<char>& a = {'a', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f', 'b', 'c', 'b', 'b', 'e', 'w', 'w', 'c', 'g', 'd', 'c', 'r', 'b', 'r', 'e', 'a', 'g', 'j', 'b', 'c', 'e', 'a', 'e', 'w', 'w', 'c', 'g', 'd', 'k', 'l', 'z', 'a', 'n', 'm', 's', 'f'};
    // solution_1(a);
    solution_2(a);
    milliseconds end_time = duration_cast<milliseconds>(
        system_clock::now().time_since_epoch());
    cout << "耗时：" << milliseconds(end_time).count() - milliseconds(start_time).count() << " ms" << endl;
}